ANSYS/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform  0.000037500000000000003; // 0.8%


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    top
    {
        type            symmetry;
    }
    bottom
    {
        type            symmetry;
    }
    outlet
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            kqRWallFunction;
        value	  $internalField;

    }

    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
