ANSYS/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.0178885438199983; //0.180720400721969;


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    top
    {
        type            symmetry;
    }
    bottom
    {
        type            symmetry;
    }
    outlet
    {
        type            zeroGradient;
    }


    airfoil
    {
        type            omegaWallFunction;
        value            uniform 10641;

    }

    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
