ANSYS/system/fvSolution
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


SIMPLE
{
    consistent                         false;
    nNonOrthogonalCorrectors           0;
        residualControl
    {
        p               1e-6;
        Ux              1e-6;
        Uy              1e-6;
        Uz              0.1;
    }
}

solvers
{
    "(p|p_rgh|G)"
    {
        
        solver                         PCG;
        smoother                       DIC;
        preconditioner	      DIC;
        relTol                         0.01;
        tolerance                      1e-8;
    }
    Phi
    {
        $p;
        relTol                         0;
        tolerance                      1e-6;
    }
    "(U|T|e|h|nuTilda|k|omega|epsilon)"
    {
        solver                         PBiCGStab;
        smoother                       DIC;
        preconditioner	      DILU;
        relTol                         0.01;
        tolerance                      1e-08;
        nSweeps                        1;
    }
}

relaxationFactors
{
    fields
    {
        "(p|p_rgh)"                    0.30;
    }
    equations
    {
        "(U|T|e|h|nuTilda|k|epsilon|omega)" 0.70;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors           20;
}

/*
solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.0;
        smoother        GaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.0;
    }

    nuTilda
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p                1e-5;
        U               1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p               0.25;
    }
    equations
    {
        U               0.7;
        nuTilda         0.7;
    }
}
*/

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
